class Urls:
    HOME_PAGE = "https://qa-scooter.praktikum-services.ru/"
    ORDER_PAGE = "https://qa-scooter.praktikum-services.ru/order"


class QuestionsText:
    TEXT_QUESTION_PRICE = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    TEXT_SEVERAL_SCOOTERS = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    TEXT_COST_CALCULATION = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    TEXT_SCOOTER_TODAY = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    TEXT_EXTEND_ORDER = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    TEXT_DELIVER_CHARGING = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    TEXT_CANCEL_ORDER = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    TEXT_LIVE_OUTSIDE_MKD = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class Data:

    EXPECTED_TITLE_TEXT = "Для кого самокат"
    DZEN_ID_TEXT = "Дзен"
